000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ЗагрузкаПлановПродаж/ЗагрузкаПлановПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПлановПродаж</name>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ПланыПродаж/ПланыПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланыПродаж</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Основная организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ЗагрузкаПлановПродаж/Forms/ФормаЗагрузки/Module.bsl
&НаСервере
Процедура ЗанестиДанныеВРегистр(КодМагазина,ГИГИЕНА,ПИТАНИЕ,ИГРУШКИ,МЕБЕЛЬ,ОБУВЬ,ОДЕЖДА,УСЛУГИ,ГИГИЕНА_инт,ПИТАНИЕ_инт,ИГРУШКИ_инт,МЕБЕЛЬ_инт,ОБУВЬ_инт,ОДЕЖДА_инт)
	
	
	КодМагазина = Число(КодМагазина);
	Магазин =  Справочники.Магазины.НайтиПоРеквизиту("НомерМагазина",КодМагазина); 
	Если не Магазин=Справочники.Магазины.ПустаяСсылка() Тогда
		СуммаПлана=0;
		НовыйПлан = РегистрыСведений.ПланыПродаж.СоздатьНаборЗаписей();
		//НовыйПлан.Период=НачалоМесяца(ДатаЗагрузки);
		НовыйПлан.Отбор.Магазин.Установить(Магазин);  
		НовыйПлан.Отбор.Период.Установить(НачалоМесяца(ДатаЗагрузки));
		//НовыйПлан.Магазин=Магазин;
		
		ПроектГигиена = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ГИГИЕНА",Истина);
		Если ГИГИЕНА<>"" и  Лев(ГИГИЕНА,1)<>"-" и ПроектГигиена<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьГигиена =  НовыйПлан.Добавить();
				ЗаписьГигиена.Магазин = Магазин;
				ЗаписьГигиена.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьГигиена.Проект = ПроектГигиена;
				ЗаписьГигиена.Сумма=Число(ГИГИЕНА);
				Если ГИГИЕНА_инт<>"" и  Лев(ГИГИЕНА_инт,1)<>"-" Тогда
					ЗаписьГигиена.СуммаИнтернет = Число(ГИГИЕНА_инт);	
				Иначе
					ЗаписьГигиена.СуммаИнтернет = 0;	
				КонецЕсли;	
				//СуммаПлана=СуммаПлана+Число(ГИГИЕНА);
				ЗаписьГигиена.Активность = Истина;
			Исключение
				Сообщить("ОШИБКА Гигиена "+ГИГИЕНА+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектПитание = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ПИТАНИЕ",Истина);
		Если ПИТАНИЕ<>"" и  Лев(ПИТАНИЕ,1)<>"-" и ПроектПитание<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьПитание =  НовыйПлан.Добавить();
				ЗаписьПитание.Магазин = Магазин;
				ЗаписьПитание.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьПитание.Проект = ПроектПитание;
				ЗаписьПитание.Сумма=Число(ПИТАНИЕ);
				Если ПИТАНИЕ_инт<>"" и  Лев(ПИТАНИЕ_инт,1)<>"-" Тогда
					ЗаписьПитание.СуммаИнтернет = Число(ПИТАНИЕ_инт);
			    Иначе
					ЗаписьПитание.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьПитание.Активность = Истина;
				//СуммаПлана=СуммаПлана+Число(ПИТАНИЕ);
			Исключение
				Сообщить("ОШИБКА ПИТАНИЕ "+ПИТАНИЕ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектИгрушка = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ИГРУШКА",Истина);
		Если ИГРУШКИ<>"" и  Лев(ИГРУШКИ,1)<>"-" и ПроектИгрушка<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьИгрушка =  НовыйПлан.Добавить();
				ЗаписьИгрушка.Магазин = Магазин;
				ЗаписьИгрушка.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьИгрушка.Проект = ПроектИгрушка;
				ЗаписьИгрушка.Сумма=Число(ИГРУШКИ);
				Если ИГРУШКИ_инт<>"" и  Лев(ИГРУШКИ_инт,1)<>"-" Тогда
					ЗаписьИгрушка.СуммаИнтернет = Число(ИГРУШКИ_инт);
			    Иначе
					ЗаписьИгрушка.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьИгрушка.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА ИГРУШКИ "+ИГРУШКИ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектМебель = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("МЕБЕЛЬ",Истина);
		Если МЕБЕЛЬ<>"" и  Лев(МЕБЕЛЬ,1)<>"-" и ПроектМебель<>Справочники.ВидыНоменклатуры.ПустаяСсылка()  Тогда
			попытка
				ЗаписьМебель =  НовыйПлан.Добавить();
				ЗаписьМебель.Магазин = Магазин;
				ЗаписьМебель.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьМебель.Проект = ПроектМебель;
				ЗаписьМебель.Сумма=Число(МЕБЕЛЬ);
				Если МЕБЕЛЬ_инт<>"" и  Лев(МЕБЕЛЬ_инт,1)<>"-" Тогда
					ЗаписьМебель.СуммаИнтернет = Число(МЕБЕЛЬ_инт);
			    Иначе
					ЗаписьМебель.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьМебель.Активность = Истина;
			Исключение
				Сообщить("ОШИБКА МЕБЕЛЬ "+МЕБЕЛЬ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектОбувь = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ОБУВЬ",Истина);
		Если ОБУВЬ<>"" и  Лев(ОБУВЬ,1)<>"-" и ПроектОбувь<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьОбувь =  НовыйПлан.Добавить();
				ЗаписьОбувь.Магазин = Магазин;
				ЗаписьОбувь.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьОбувь.Проект = ПроектОбувь;
				ЗаписьОбувь.Сумма=Число(ОБУВЬ);
				Если ОБУВЬ_инт<>"" и  Лев(ОБУВЬ_инт,1)<>"-" Тогда
					ЗаписьОбувь.СуммаИнтернет = Число(ОБУВЬ_инт);
			    Иначе
					ЗаписьОбувь.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьОбувь.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА ОБУВЬ "+ОБУВЬ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектОдежда = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ОДЕЖДА",Истина);
		Если ОДЕЖДА<>"" и  Лев(ОДЕЖДА,1)<>"-" и ПроектОдежда<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьОдежда =  НовыйПлан.Добавить();
				ЗаписьОдежда.Магазин = Магазин;
				ЗаписьОдежда.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьОдежда.Проект = ПроектОдежда;
				ЗаписьОдежда.Сумма=Число(ОДЕЖДА);
				Если ОДЕЖДА_инт<>"" и  Лев(ОДЕЖДА_инт,1)<>"-" Тогда
					ЗаписьОдежда.СуммаИнтернет = Число(ОДЕЖДА_инт);
			    Иначе
					ЗаписьОдежда.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьОдежда.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА ОДЕЖДА "+ОДЕЖДА+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектУслуги = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продажа услуг",Истина);
		Если УСЛУГИ<>"" и  Лев(УСЛУГИ,1)<>"-" Тогда
			попытка
				ЗаписьУслуги =  НовыйПлан.Добавить();
				ЗаписьУслуги.Магазин = Магазин;
				ЗаписьУслуги.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьУслуги.Проект = ПроектУслуги;
				ЗаписьУслуги.Сумма=Число(УСЛУГИ);
				ЗаписьУслуги.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА УСЛУГИ "+УСЛУГИ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		
			//попытка
			//	НовыйПлан.Сумма=Число(СуммаПлана);
			//Исключение
			//	Сообщить("ОШИБКА СуммаПлана "+Строка(СуммаПлана)+" "+КодМагазина);
			//КонецПопытки;
			попытка		
				НовыйПлан.Записать(Истина);
			исключение
				Сообщить("не удалось записать магазин - "+ КодМагазина);

			КонецПопытки
	Иначе
		Сообщить("не найден магазин - "+ КодМагазина);
	Конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьТаблицу(Команда)
	ошибка=ложь;
	НомерСтроки=3;
	
		

	КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
	

	пока  КодМагазина<>"" цикл
				
		//НомерСтроки=НомерСтроки+1;
		КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		ГИГИЕНА = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(3,"ЧГ=")).Текст)," ","");
		ПИТАНИЕ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(4,"ЧГ=")).Текст)," ","");
		ИГРУШКИ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(5,"ЧГ=")).Текст)," ","");
		МЕБЕЛЬ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(6,"ЧГ=")).Текст)," ","");
		ОБУВЬ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(7,"ЧГ=")).Текст)," ","");
		ОДЕЖДА = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(8,"ЧГ=")).Текст)," ","");
		УСЛУГИ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(9,"ЧГ=")).Текст)," ","");
		
		ГИГИЕНА_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(10,"ЧГ=")).Текст)," ","");
		ПИТАНИЕ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(11,"ЧГ=")).Текст)," ","");
		ИГРУШКИ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(12,"ЧГ=")).Текст)," ","");
		МЕБЕЛЬ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(13,"ЧГ=")).Текст)," ","");
		ОБУВЬ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(14,"ЧГ=")).Текст)," ","");
		ОДЕЖДА_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(15,"ЧГ=")).Текст)," ","");
		
		Если КодМагазина<>"END" Тогда
			ЗанестиДанныеВРегистр(КодМагазина,ГИГИЕНА,ПИТАНИЕ,ИГРУШКИ,МЕБЕЛЬ,ОБУВЬ,ОДЕЖДА,УСЛУГИ,ГИГИЕНА_инт,ПИТАНИЕ_инт,ИГРУШКИ_инт,МЕБЕЛЬ_инт,ОБУВЬ_инт,ОДЕЖДА_инт);
			Состояние(Строка(НомерСтроки));	
		конецесли;
		
		НомерСтроки=НомерСтроки+1;
		КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		обработкапрерыванияпользователя();
		
	конеццикла;
    ПоказатьПредупреждение(, "Данные загружены");	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаЗагрузки = НачалоМесяца(текущаядата());
КонецПроцедуры
